Public Class EXE6DataList
    '改造カードのリスト
    Public Shared RemodelCardList() As String = { _
     "01:キャノーダム", _
     "02:アモナキュール", _
     "03:コルドベア", _
     "04:ジーラ", _
     "05:メガリア", _
     "06:メテファイア", _
     "07:キルプラント", _
     "08:ダークシャドー", _
     "09:ボンビートル", _
     "0A:ヘビーアレイ", _
     "0B:アゾマータ", _
     "0C:ジェライム", _
     "0D:ボルカノ", _
     "0E:ナンバーズ", _
     "0F:マグテクト", _
     "10:クーモス", _
     "11:ボムボーイ", _
     "12:ウドノート", _
     "13:ピカラー", _
     "14:エレオーガ", _
     "15:ダルスト", _
     "16:センボン", _
     "17:ヒトデスタ", _
     "18:グラサン", _
     "19:カカジー", _
     "1A:ゼロプレーン", _
     "1B:レムゴン", _
     "1C:アルマン", _
     "1D:ヤカーン", _
     "1E:ツボリュウ", _
     "1F:ナンバーマン", _
     "20:アイスマン", _
     "21:スカルマン", _
     "22:シャドーマン", _
     "23:カットマン", _
     "24:ナイトマン", _
     "25:トードマン", _
     "26:マグネットマン", _
     "27:プラネットマン", _
     "28:ビーストマン", _
     "29:デザートマン", _
     "2A:ヤマトマン", _
     "2B:ビデオマン", _
     "2C:バーナーマン", _
     "2D:スターマン", _
     "2E:ブリザードマン", _
     "2F:スワローマン", _
     "30:スラッシュマン", _
     "31:キラーマン", _
     "32:グランドマン", _
     "33:ダストマン", _
     "34:ブラストマン", _
     "35:サーカスマン", _
     "36:ハンディーズ", _
     "37:プークル", _
     "38:ジェリー", _
     "39:ポイットン", _
     "3A:サテラ", _
     "3B:パララ＆リモコゴロー", _
     "3C:ユラ", _
     "3D:タコバル", _
     "3E:シェルキー", _
     "3F:マグニッカー", _
     "40:メテマージ", _
     "41:モモグラン", _
     "42:ニドキャスター", _
     "43:ツインズ", _
     "44:ウォーラ", _
     "45:キルブー", _
     "46:トトポール", _
     "47:キャノガード", _
     "48:スカラビア", _
     "49:ドラグリン", _
     "4A:マリーナ", _
     "4B:ドルダーラ", _
     "4C:ガンナー", _
     "4D:パルフォロン", _
     "4E:ボムコーン", _
     "4F:モリキュー", _
     "50:ハニホー", _
     "51:ナイトメア", _
     "52:スナーム", _
     "53:アサシンメカ", _
     "54:ストーンマン", _
     "55:カラードマン", _
     "56:シャークマン", _
     "57:ファラオマン", _
     "58:エアーマン", _
     "59:フリーズマン", _
     "5A:サンダーマン", _
     "5B:ナパームマン", _
     "5C:プラントマン", _
     "5D:ミストマン", _
     "5E:ボウルマン", _
     "5F:ダークマン", _
     "60:タップマン", _
     "61:ケンドーマン", _
     "62:コールドマン", _
     "63:サーチマン", _
     "64:クラウドマン", _
     "65:フットマン", _
     "66:チャージマン", _
     "67:テングマン", _
     "68:ダイブマン", _
     "69:ジャッジマン", _
     "6A:エレメントマン", _
     "6B:パンク", _
     "6C:ダークロックマン", _
     "6D:ソウルバトラーのカスタマイズ", _
     "6E:名人のちょうぜつカスタマイズ", _
     "6F:フォルテＢＸ", _
     "70:ジャンゴ", _
     "71:ハクシャク", _
     "72:ロックマンゼロ", _
     "73:電脳獣グレイガ", _
     "74:電脳獣ファルザー", _
     "75:フォルテクロスロックマン" _
 }

    'ナビカスタマイザーのリスト
    Public Shared NaviCusName() As String = { _
        "スーパーアーマー(赤)", _
        "カスタム１(青)", _
        "カスタム２(白)", _
        "メガフォルダ１(緑)", _
        "メガフォルダ２(白)", _
        "ギガフォルダ１(赤)", _
        "ファーストバリア(青)", _
        "シールド(青)", _
        "リフレクト(緑)", _
        "カワリミマジック(緑)", _
        "フロートシューズ(桃)", _
        "エアシューズ(白)", _
        "アンダーシャツ(白)", _
        "サーチシャッフル(緑)", _
        "ナンバーオープン(桃)", _
        "シノビダッシュ(白)", _
        "オイルボディ(赤)", _
        "アイムフィッシュ(青)", _
        "バッテリーモード(黄)", _
        "ジャングルランド(緑)", _
        "コレクターズアイ(桃)", _
        "ミリオネア(赤)", _
        "ユーモアセンス(桃)", _
        "リズミカルポエム(黄)", _
        "スリップランナー(黄)", _
        "セルフリカバリー(桃)", _
        "バスターパック(赤)", _
        "ボディパック(桃)", _
        "フォルダパック１(黄)", _
        "フォルダパック２(桃)", _
        "バグストッパー(黄)", _
        "ラッシュサポート(黄)", _
        "ビートサポート(青)", _
        "タンゴサポート(緑)", _
        "アタック＋１(桃)", _
        "アタック＋１(赤)", _
        "アタック＋１(青)", _
        "ラピッド＋１(白)", _
        "ラピッド＋１(桃)", _
        "ラピッド＋１(緑)", _
        "チャージ＋１(白)", _
        "チャージ＋１(青)", _
        "チャージ＋１(桃)", _
        "アタックＭＡＸ(赤)", _
        "ラピッドＭＡＸ(緑)", _
        "チャージＭＡＸ(青)", _
        "ＨＰ＋５０(白)", _
        "ＨＰ＋５０(桃)", _
        "ＨＰ＋５０(青)", _
        "ＨＰ＋１００(白)", _
        "ＨＰ＋１００(桃)", _
        "ＨＰ＋１００(青)", _
        "ＨＰ＋２００(白)", _
        "ＨＰ＋２００(黄)", _
        "ＨＰ＋２００(青)", _
        "ＨＰ＋３００(白)", _
        "ＨＰ＋３００(桃)", _
        "ＨＰ＋３００(緑)", _
        "ＨＰ＋４００(白)", _
        "ＨＰ＋４００(黄)", _
        "ＨＰ＋４００(緑)", _
        "ＨＰ＋５００(白)", _
        "ＨＰ＋５００(桃)", _
        "ＨＰ＋５００(緑)" _
    }

    'ナビカスタマイザーのアドレス
    'フラグ基準アドレス、フラグ書き込みアドレス、個数アドレス
    Public Shared NaviCusAddr(,) As Integer = { _
        {&H574, &H4AE0, &H31C8}, _
        {&H578, &H4AE4, &H31CC}, _
        {&H57C, &H4AE8, &H31D0}, _
        {&H580, &H4AEC, &H31D4}, _
        {&H584, &H4AF0, &H31D8}, _
        {&H588, &H4AF4, &H31DC}, _
        {&H58C, &H4AF8, &H31E0}, _
        {&H590, &H4AFC, &H31E4}, _
        {&H594, &H4B00, &H31E8}, _
        {&H598, &H4B04, &H31EC}, _
        {&H59C, &H4B08, &H31F0}, _
        {&H5A0, &H4B0C, &H31F4}, _
        {&H5A4, &H4B10, &H31F8}, _
        {&H5A8, &H4B14, &H31FC}, _
        {&H5AC, &H4B18, &H3200}, _
        {&H5B0, &H4B1C, &H3204}, _
        {&H5B4, &H4B20, &H3208}, _
        {&H5B8, &H4B24, &H320C}, _
        {&H5BC, &H4B28, &H3210}, _
        {&H5C0, &H4B2C, &H3214}, _
        {&H5C4, &H4B30, &H3218}, _
        {&H5C8, &H4B34, &H321C}, _
        {&H5CC, &H4B38, &H3220}, _
        {&H5D0, &H4B3C, &H3224}, _
        {&H5D4, &H4B40, &H3228}, _
        {&H5D8, &H4B44, &H322C}, _
        {&H5DC, &H4B48, &H3230}, _
        {&H5E0, &H4B4C, &H3234}, _
        {&H5E4, &H4B50, &H3238}, _
        {&H5E8, &H4B54, &H323C}, _
        {&H5EC, &H4B58, &H3240}, _
        {&H5F0, &H4B5C, &H3244}, _
        {&H5F4, &H4B60, &H3248}, _
        {&H5F8, &H4B64, &H324C}, _
        {&H5FC, &H4B68, &H3250}, _
        {&H5FD, &H4B69, &H3251}, _
        {&H5FE, &H4B6A, &H3252}, _
        {&H600, &H4B6C, &H3254}, _
        {&H601, &H4B6D, &H3255}, _
        {&H602, &H4B6E, &H3256}, _
        {&H604, &H4B70, &H3258}, _
        {&H605, &H4B71, &H3259}, _
        {&H606, &H4B72, &H325A}, _
        {&H608, &H4B74, &H325C}, _
        {&H60C, &H4B78, &H3260}, _
        {&H610, &H4B7C, &H3264}, _
        {&H614, &H4B80, &H3268}, _
        {&H615, &H4B81, &H3269}, _
        {&H616, &H4B82, &H326A}, _
        {&H618, &H4B84, &H326C}, _
        {&H619, &H4B85, &H326D}, _
        {&H61A, &H4B86, &H326E}, _
        {&H61C, &H4B88, &H3270}, _
        {&H61D, &H4B89, &H3271}, _
        {&H61E, &H4B8A, &H3272}, _
        {&H620, &H4B8C, &H3274}, _
        {&H621, &H4B8D, &H3275}, _
        {&H622, &H4B8E, &H3276}, _
        {&H624, &H4B90, &H3278}, _
        {&H625, &H4B91, &H3279}, _
        {&H626, &H4B92, &H327A}, _
        {&H628, &H4B94, &H327C}, _
        {&H629, &H4B95, &H327D}, _
        {&H62A, &H4B96, &H327E} _
    }

    'キーアイテムリスト
    Public Shared KeyItemList() As String = { _
        "ＰＥＴ", _
        "せいとてちょう", _
        "バケツ", _
        "しょくいんパス", _
        "ラクガキ", _
        "ウォーターデータ", _
        "カギデータ", _
        "さかな", _
        "こうぐプログラム", _
        "あそびどうぐ", _
        "いやしの水", _
        "タッグチップ", _
        "じけんのしりょう", _
        "えいぞうデータ", _
        "きょかデータ", _
        "あまガサ", _
        "しょうりカードＡ", _
        "しょうりカードＢ", _
        "しょうりカードＣ", _
        "しょうりカードＤ", _
        "サイバーでんち１", _
        "サイバーでんち２", _
        "サイバーでんち３", _
        "サイバーでんち４", _
        "サイバーでんち５", _
        "つきのいし", _
        "秋原のカギデータ", _
        "エリアパスポート", _
        "バキュームデータ", _
        "かいちゅうどけい", _
        "トロデータ", _
        "イクラデータ", _
        "アナゴデータ", _
        "エビデータ", _
        "カズノコデータ", _
        "ハマチデータ", _
        "ウニデータ", _
        "タイデータ", _
        "タイムカプセル", _
        "キャッシュデータ", _
        "テキストデータ", _
        "ペンダント", _
        "へんじのてがみ", _
        "スタンプカード", _
        "ラッシュフード", _
        "電脳オノ", _
        "チューリップ", _
        "アップデートデータ", _
        "コーヒー", _
        "きみつデータ", _
        "クロスバッチ", _
        "コウモリのカギ", _
        "ひみつのメモ", _
        "クイズデータ", _
        "はしりがきデータ", _
        "ペンギンのおれい", _
        "さんこうしょ", _
        "クイズのほん", _
        "しょうたいけん", _
        "かんしゃじょう", _
        "シリアルデータ", _
        "科学にゅうもん", _
        "ソウルエンブレム", _
        "ナビのざんがい", _
        "バトラーカード", _
        "フライドポテト", _
        "マサカリ", _
        "よやくけん", _
        "ＷＷＷＩＤ", _
        "太陽のカギ", _
        "シーサードのカギ", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンホワイト", _
        "スピンイエロー", _
        "スピンピンク", _
        "スピンレッド", _
        "スピンブルー", _
        "スピングリーン", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "学校のPコード", _
        "水のバナー", _
        "水のバナー", _
        "水のバナー", _
        "水のバナー", _
        "水のバナー", _
        "水のバナー", _
        "水のバナー", _
        "水のバナー", _
        "グリーンバナー", _
        "スカイバナー", _
        "秋原のバナー", _
        "ＨＰメモリ", _
        "ＰＥＴ", _
        "ＨＰメモリ", _
        "ＨＰメモリ" _
    }

    'チップの名前のリスト
    Public Shared ChipNameList() As String = { _
        "キャノン（A", _
        "キャノン（B", _
        "キャノン（C", _
        "キャノン（*", _
        "ハイキャノン（L", _
        "ハイキャノン（M", _
        "ハイキャノン（N", _
        "ハイキャノン（*", _
        "メガキャノン（R", _
        "メガキャノン（S", _
        "メガキャノン（T", _
        "メガキャノン（*", _
        "エアシュ－ト（*", _
        "バルカン１（B", _
        "バルカン１（D", _
        "バルカン１（S", _
        "バルカン１（*", _
        "バルカン２（D", _
        "バルカン２（F", _
        "バルカン２（L", _
        "バルカン３（A", _
        "バルカン３（G", _
        "バルカン３（R", _
        "ス－パ－バルカン（V", _
        "スプレッドガン１（L", _
        "スプレッドガン１（M", _
        "スプレッドガン１（N", _
        "スプレッドガン１（*", _
        "スプレッドガン２（A", _
        "スプレッドガン２（B", _
        "スプレッドガン２（C", _
        "スプレッドガン２（*", _
        "スプレッドガン３（Q", _
        "スプレッドガン３（R", _
        "スプレッドガン３（S", _
        "スプレッドガン３（*", _
        "センシャホウ１（A", _
        "センシャホウ１（G", _
        "センシャホウ１（R", _
        "センシャホウ２（L", _
        "センシャホウ２（S", _
        "センシャホウ２（V", _
        "センシャホウ３（B", _
        "センシャホウ３（M", _
        "センシャホウ３（P", _
        "ガンデルソル１（C", _
        "ガンデルソル１（M", _
        "ガンデルソル１（T", _
        "ガンデルソル１（*", _
        "ガンデルソル２（B", _
        "ガンデルソル２（E", _
        "ガンデルソル２（R", _
        "ガンデルソル３（N", _
        "ガンデルソル３（Q", _
        "ガンデルソル３（W", _
        "ガンデルソルＥＸ（G", _
        "ヨ－ヨ－（L", _
        "ヨ－ヨ－（M", _
        "ヨ－ヨ－（N", _
        "ヨ－ヨ－（*", _
        "ヘルズバ－ナ－１（F", _
        "ヘルズバ－ナ－１（G", _
        "ヘルズバ－ナ－１（H", _
        "ヘルズバ－ナ－１（*", _
        "ヘルズバ－ナ－２（S", _
        "ヘルズバ－ナ－２（T", _
        "ヘルズバ－ナ－２（U", _
        "ヘルズバ－ナ－３（C", _
        "ヘルズバ－ナ－３（D", _
        "ヘルズバ－ナ－３（E", _
        "ワイドショット（P", _
        "ワイドショット（Q", _
        "ワイドショット（R", _
        "トレインアロ－１（A", _
        "トレインアロ－１（F", _
        "トレインアロ－１（K", _
        "トレインアロ－２（G", _
        "トレインアロ－２（M", _
        "トレインアロ－２（Z", _
        "トレインアロ－３（M", _
        "トレインアロ－３（S", _
        "トレインアロ－３（Y", _
        "バブルスタ－１（B", _
        "バブルスタ－１（E", _
        "バブルスタ－１（T", _
        "バブルスタ－２（C", _
        "バブルスタ－２（L", _
        "バブルスタ－２（V", _
        "バブルスタ－３（G", _
        "バブルスタ－３（R", _
        "バブルスタ－３（S", _
        "サンダ－ボ－ル（B", _
        "サンダ－ボ－ル（R", _
        "サンダ－ボ－ル（S", _
        "サンダ－ボ－ル（*", _
        "ド－ルサンダ－１（A", _
        "ド－ルサンダ－１（E", _
        "ド－ルサンダ－１（Q", _
        "ド－ルサンダ－２（C", _
        "ド－ルサンダ－２（L", _
        "ド－ルサンダ－２（P", _
        "ド－ルサンダ－３（B", _
        "ド－ルサンダ－３（R", _
        "ド－ルサンダ－３（V", _
        "エレキパルス１（J", _
        "エレキパルス１（L", _
        "エレキパルス１（S", _
        "エレキパルス２（A", _
        "エレキパルス２（E", _
        "エレキパルス２（J", _
        "エレキパルス３（A", _
        "エレキパルス３（J", _
        "エレキパルス３（S", _
        "リスキ－ハニ－１（B", _
        "リスキ－ハニ－１（G", _
        "リスキ－ハニ－１（S", _
        "リスキ－ハニ－２（C", _
        "リスキ－ハニ－２（R", _
        "リスキ－ハニ－２（V", _
        "リスキ－ハニ－３（A", _
        "リスキ－ハニ－３（D", _
        "リスキ－ハニ－３（M", _
        "ロ－リングログ１（I", _
        "ロ－リングログ１（K", _
        "ロ－リングログ１（P", _
        "ロ－リングログ２（E", _
        "ロ－リングログ２（Q", _
        "ロ－リングログ２（Z", _
        "ロ－リングログ３（F", _
        "ロ－リングログ３（N", _
        "ロ－リングログ３（W", _
        "マシンガン１（A", _
        "マシンガン１（R", _
        "マシンガン１（T", _
        "マシンガン１（*", _
        "マシンガン２（E", _
        "マシンガン２（G", _
        "マシンガン２（S", _
        "マシンガン３（B", _
        "マシンガン３（F", _
        "マシンガン３（M", _
        "ヒ－トドラゴン（G", _
        "ヒ－トドラゴン（R", _
        "ヒ－トドラゴン（T", _
        "エレキドラゴン（A", _
        "エレキドラゴン（L", _
        "エレキドラゴン（V", _
        "アクアドラゴン（H", _
        "アクアドラゴン（P", _
        "アクアドラゴン（S", _
        "ウッドドラゴン（G", _
        "ウッドドラゴン（T", _
        "ウッドドラゴン（V", _
        "エアホッケ－（L", _
        "エアホッケ－（M", _
        "エアホッケ－（N", _
        "ドリルア－ム（G", _
        "ドリルア－ム（M", _
        "ドリルア－ム（W", _
        "トルネ－ド（L", _
        "トルネ－ド（R", _
        "トルネ－ド（T", _
        "ノイズスト－ム（G", _
        "ノイズスト－ム（S", _
        "ノイズスト－ム（V", _
        "ミニボム（B", _
        "ミニボム（L", _
        "ミニボム（R", _
        "ミニボム（*", _
        "エナジ－ボム（C", _
        "エナジ－ボム（K", _
        "エナジ－ボム（V", _
        "エナジ－ボム（*", _
        "メガエナジ－ボム（G", _
        "メガエナジ－ボム（M", _
        "メガエナジ－ボム（O", _
        "メガエナジ－ボム（*", _
        "フラッシュボム１（J", _
        "フラッシュボム１（L", _
        "フラッシュボム１（Q", _
        "フラッシュボム１（*", _
        "フラッシュボム２（G", _
        "フラッシュボム２（K", _
        "フラッシュボム２（R", _
        "フラッシュボム３（H", _
        "フラッシュボム３（P", _
        "フラッシュボム３（S", _
        "ブラックボム（B", _
        "ブラックボム（F", _
        "ブラックボム（O", _
        "アクアニ－ドル１（C", _
        "アクアニ－ドル１（J", _
        "アクアニ－ドル１（P", _
        "アクアニ－ドル２（F", _
        "アクアニ－ドル２（K", _
        "アクアニ－ドル２（T", _
        "アクアニ－ドル３（A", _
        "アクアニ－ドル３（L", _
        "アクアニ－ドル３（U", _
        "コ－ンショット１（J", _
        "コ－ンショット１（K", _
        "コ－ンショット１（L", _
        "コ－ンショット２（C", _
        "コ－ンショット２（D", _
        "コ－ンショット２（E", _
        "コ－ンショット３（P", _
        "コ－ンショット３（Q", _
        "コ－ンショット３（R", _
        "バグボム（G", _
        "バグボム（S", _
        "バグボム（V", _
        "クサムラシ－ド（A", _
        "クサムラシ－ド（F", _
        "クサムラシ－ド（S", _
        "クサムラシ－ド（*", _
        "アイスシ－ド（A", _
        "アイスシ－ド（L", _
        "アイスシ－ド（R", _
        "アイスシ－ド（*", _
        "ポイズンシ－ド（H", _
        "ポイズンシ－ド（N", _
        "ポイズンシ－ド（P", _
        "ポイズンシ－ド（*", _
        "ソ－ド（H", _
        "ソ－ド（L", _
        "ソ－ド（S", _
        "ソ－ド（*", _
        "ワイドソ－ド（H", _
        "ワイドソ－ド（L", _
        "ワイドソ－ド（S", _
        "ワイドソ－ド（*", _
        "ロングソ－ド（H", _
        "ロングソ－ド（L", _
        "ロングソ－ド（S", _
        "ロングソ－ド（*", _
        "ワイドブレ－ド（B", _
        "ワイドブレ－ド（R", _
        "ワイドブレ－ド（W", _
        "ロングブレ－ド（B", _
        "ロングブレ－ド（M", _
        "ロングブレ－ド（V", _
        "フレイムソ－ド（F", _
        "フレイムソ－ド（O", _
        "フレイムソ－ド（Z", _
        "アクアソ－ド（A", _
        "アクアソ－ド（I", _
        "アクアソ－ド（Y", _
        "エレキソ－ド（E", _
        "エレキソ－ド（K", _
        "エレキソ－ド（N", _
        "バンブ－ソ－ド（H", _
        "バンブ－ソ－ド（S", _
        "バンブ－ソ－ド（W", _
        "フウジンラケット（F", _
        "フウジンラケット（J", _
        "フウジンラケット（R", _
        "フウジンラケット（*", _
        "フミコミザン（B", _
        "フミコミザン（L", _
        "フミコミザン（P", _
        "バリアブルソ－ド（K", _
        "バリアブルソ－ド（V", _
        "バリアブルソ－ド（W", _
        "ネオバリアブル（N", _
        "エンゲツクナイ（A", _
        "エンゲツクナイ（M", _
        "エンゲツクナイ（T", _
        "ムラマサブレ－ド（M", _
        "マシ－ンソ－ド（H", _
        "マシ－ンソ－ド（L", _
        "マシ－ンソ－ド（Q", _
        "エレメントソ－ド（J", _
        "エレメントソ－ド（M", _
        "エレメントソ－ド（U", _
        "アサシンソ－ド（N", _
        "アサシンソ－ド（R", _
        "アサシンソ－ド（Y", _
        "クラックシュ－ト（A", _
        "クラックシュ－ト（G", _
        "クラックシュ－ト（T", _
        "クラックシュ－ト（*", _
        "ダブルシュ－ト（C", _
        "ダブルシュ－ト（R", _
        "ダブルシュ－ト（U", _
        "ダブルシュ－ト（*", _
        "トリプルシュ－ト（J", _
        "トリプルシュ－ト（L", _
        "トリプルシュ－ト（V", _
        "トリプルシュ－ト（*", _
        "ウェ－ブア－ム１（E", _
        "ウェ－ブア－ム１（F", _
        "ウェ－ブア－ム１（G", _
        "ウェ－ブア－ム２（L", _
        "ウェ－ブア－ム２（M", _
        "ウェ－ブア－ム２（N", _
        "ウェ－ブア－ム３（R", _
        "ウェ－ブア－ム３（S", _
        "ウェ－ブア－ム３（T", _
        "オ－ラヘッド１（B", _
        "オ－ラヘッド１（C", _
        "オ－ラヘッド１（D", _
        "オ－ラヘッド２（D", _
        "オ－ラヘッド２（E", _
        "オ－ラヘッド２（F", _
        "オ－ラヘッド３（F", _
        "オ－ラヘッド３（G", _
        "オ－ラヘッド３（H", _
        "リトルボイラ－１（F", _
        "リトルボイラ－１（K", _
        "リトルボイラ－１（L", _
        "リトルボイラ－２（E", _
        "リトルボイラ－２（M", _
        "リトルボイラ－２（V", _
        "リトルボイラ－３（G", _
        "リトルボイラ－３（S", _
        "リトルボイラ－３（Z", _
        "サンドワ－ム１（A", _
        "サンドワ－ム１（G", _
        "サンドワ－ム１（L", _
        "サンドワ－ム２（B", _
        "サンドワ－ム２（R", _
        "サンドワ－ム２（Y", _
        "サンドワ－ム３（H", _
        "サンドワ－ム３（J", _
        "サンドワ－ム３（S", _
        "エアレイド１（G", _
        "エアレイド１（K", _
        "エアレイド１（R", _
        "エアレイド２（O", _
        "エアレイド２（T", _
        "エアレイド２（Y", _
        "エアレイド３（N", _
        "エアレイド３（U", _
        "エアレイド３（Z", _
        "ファイアパンチ１（D", _
        "ファイアパンチ１（E", _
        "ファイアパンチ１（F", _
        "ファイアパンチ２（R", _
        "ファイアパンチ２（S", _
        "ファイアパンチ２（T", _
        "ファイアパンチ３（A", _
        "ファイアパンチ３（B", _
        "ファイアパンチ３（C", _
        "バ－ンスクエア１（H", _
        "バ－ンスクエア１（P", _
        "バ－ンスクエア１（V", _
        "バ－ンスクエア２（D", _
        "バ－ンスクエア２（M", _
        "バ－ンスクエア２（T", _
        "バ－ンスクエア３（E", _
        "バ－ンスクエア３（O", _
        "バ－ンスクエア３（Z", _
        "キラ－センサ－１（J", _
        "キラ－センサ－１（O", _
        "キラ－センサ－１（W", _
        "キラ－センサ－２（N", _
        "キラ－センサ－２（U", _
        "キラ－センサ－２（Y", _
        "キラ－センサ－３（I", _
        "キラ－センサ－３（K", _
        "キラ－センサ－３（Q", _
        "ブ－メラン（J", _
        "ブ－メラン（K", _
        "ブ－メラン（T", _
        "ハイブ－メラン（B", _
        "ハイブ－メラン（L", _
        "ハイブ－メラン（V", _
        "メガブ－メラン（I", _
        "メガブ－メラン（M", _
        "メガブ－メラン（W", _
        "バンブ－ランス（A", _
        "バンブ－ランス（R", _
        "バンブ－ランス（W", _
        "バンブ－ランス（*", _
        "ゴ－レムパンチ１（I", _
        "ゴ－レムパンチ１（K", _
        "ゴ－レムパンチ１（Y", _
        "ゴ－レムパンチ２（D", _
        "ゴ－レムパンチ２（P", _
        "ゴ－レムパンチ２（U", _
        "ゴ－レムパンチ３（H", _
        "ゴ－レムパンチ３（M", _
        "ゴ－レムパンチ３（V", _
        "アイアンシェル１（J", _
        "アイアンシェル１（K", _
        "アイアンシェル１（L", _
        "アイアンシェル２（C", _
        "アイアンシェル２（D", _
        "アイアンシェル２（E", _
        "アイアンシェル３（L", _
        "アイアンシェル３（M", _
        "アイアンシェル３（N", _
        "エアホイ－ル１（F", _
        "エアホイ－ル１（G", _
        "エアホイ－ル１（R", _
        "エアホイ－ル２（A", _
        "エアホイ－ル２（L", _
        "エアホイ－ル２（T", _
        "エアホイ－ル３（N", _
        "エアホイ－ル３（O", _
        "エアホイ－ル３（T", _
        "トップウ（*", _
        "スイコミ（*", _
        "リフレクメット１（A", _
        "リフレクメット１（C", _
        "リフレクメット１（P", _
        "リフレクメット１（*", _
        "リフレクメット２（B", _
        "リフレクメット２（G", _
        "リフレクメット２（Y", _
        "リフレクメット２（*", _
        "リフレクメット３（E", _
        "リフレクメット３（F", _
        "リフレクメット３（O", _
        "リフレクメット３（*", _
        "カモンスネ－ク（H", _
        "カモンスネ－ク（M", _
        "カモンスネ－ク（L", _
        "サモンブラック１（E", _
        "サモンブラック１（I", _
        "サモンブラック１（P", _
        "サモンブラック２（H", _
        "サモンブラック２（O", _
        "サモンブラック２（V", _
        "サモンブラック３（W", _
        "サモンブラック３（Y", _
        "サモンブラック３（Z", _
        "ナンバ－ボ－ル（N", _
        "リュウセイグン（R", _
        "ジャスティスワン（J", _
        "マグナム（F", _
        "マグナム（L", _
        "マグナム（W", _
        "サ－クルガン（P", _
        "サ－クルガン（T", _
        "サ－クルガン（V", _
        "スト－ンキュ－ブ（*", _
        "カウントボム１（F", _
        "カウントボム１（G", _
        "カウントボム１（H", _
        "ステルスマイン（A", _
        "ステルスマイン（S", _
        "ステルスマイン（T", _
        "オウエンカ（P", _
        "オウエンカ（S", _
        "オウエンカ（Z", _
        "オウエンカ（*", _
        "ディスコ－ド（A", _
        "ディスコ－ド（G", _
        "ディスコ－ド（S", _
        "ディスコ－ド（*", _
        "ティンパニ－（I", _
        "ティンパニ－（O", _
        "ティンパニ－（T", _
        "ティンパニ－（*", _
        "サイレンス（B", _
        "サイレンス（R", _
        "サイレンス（W", _
        "サイレンス（*", _
        "ワラニンギョウ（F", _
        "ワラニンギョウ（N", _
        "ワラニンギョウ（S", _
        "ワラニンギョウ（*", _
        "オジゾウサン（O", _
        "ポイズンアヌビス（P", _
        "オテンコサマ（O", _
        "リカバリ－１０（A", _
        "リカバリ－１０（D", _
        "リカバリ－１０（L", _
        "リカバリ－１０（*", _
        "リカバリ－３０（E", _
        "リカバリ－３０（L", _
        "リカバリ－３０（Q", _
        "リカバリ－３０（*", _
        "リカバリ－５０（C", _
        "リカバリ－５０（M", _
        "リカバリ－５０（P", _
        "リカバリ－５０（*", _
        "リカバリ－８０（H", _
        "リカバリ－８０（K", _
        "リカバリ－８０（V", _
        "リカバリ－８０（*", _
        "リカバリ－１２０（F", _
        "リカバリ－１２０（P", _
        "リカバリ－１２０（S", _
        "リカバリ－１５０（J", _
        "リカバリ－１５０（M", _
        "リカバリ－１５０（T", _
        "リカバリ－２００（I", _
        "リカバリ－２００（Q", _
        "リカバリ－２００（Z", _
        "リカバリ－３００（J", _
        "リカバリ－３００（O", _
        "リカバリ－３００（Y", _
        "パネルスチ－ル（*", _
        "エリアスチ－ル（B", _
        "エリアスチ－ル（F", _
        "エリアスチ－ル（S", _
        "エリアスチ－ル（*", _
        "スチ－ルパニシュ（B", _
        "スチ－ルパニシュ（M", _
        "スチ－ルパニシュ（S", _
        "スチ－ルリベンジ（I", _
        "スチ－ルリベンジ（Q", _
        "スチ－ルリベンジ（Z", _
        "パネルリタ－ン（*", _
        "デスマッチ（A", _
        "デスマッチ（L", _
        "デスマッチ（R", _
        "デスマッチ（*", _
        "ホ－リ－パネル（A", _
        "ホ－リ－パネル（B", _
        "ホ－リ－パネル（S", _
        "ホ－リ－パネル（*", _
        "サンクチュアリ（Z", _
        "カミングロ－ド（*", _
        "ゴ－イングロ－ド（*", _
        "ヘビ－ゲ－ジ（A", _
        "ヘビ－ゲ－ジ（B", _
        "ヘビ－ゲ－ジ（G", _
        "ヘビ－ゲ－ジ（*", _
        "クイックゲ－ジ（E", _
        "クイックゲ－ジ（M", _
        "クイックゲ－ジ（R", _
        "クイックゲ－ジ（*", _
        "フルカスタム（*", _
        "バスタ－アップ（*", _
        "バグシュウセイ（K", _
        "バグシュウセイ（P", _
        "バグシュウセイ（Z", _
        "バグシュウセイ（*", _
        "インビジブル（*", _
        "バリア（A", _
        "バリア（F", _
        "バリア（R", _
        "バリア（*", _
        "バリア１００（H", _
        "バリア１００（O", _
        "バリア１００（Y", _
        "バリア２００（K", _
        "バリア２００（U", _
        "バリア２００（W", _
        "バブルラップ（I", _
        "バブルラップ（Q", _
        "バブルラップ（Z", _
        "ドリ－ムオ－ラ（U", _
        "マグネコイル（*", _
        "ホワイトカプセル（*", _
        "アンインスト－ル（G", _
        "アンインスト－ル（L", _
        "アンインスト－ル（R", _
        "ナビスカウト（F", _
        "ナビスカウト（L", _
        "ナビスカウト（T", _
        "ナビスカウト（*", _
        "カワリミ（G", _
        "カワリミ（R", _
        "カワリミ（V", _
        "カワリミ（*", _
        "シラハドリ（A", _
        "シラハドリ（R", _
        "シラハドリ（Z", _
        "シラハドリ（*", _
        "バッドメディスン（A", _
        "バッドメディスン（F", _
        "バッドメディスン（V", _
        "バッドメディスン（*", _
        "コピ－ダメ－ジ（*", _
        "ライフシンクロ（*", _
        "アタック＋１０（*", _
        "ナビ＋２０（*", _
        "カラ－ポイント（*", _
        "アタック＋３０（*", _
        "ダブルポイント（*", _
        "エレメントラップ（G", _
        "エレメントラップ（S", _
        "エレメントラップ（U", _
        "エレメントラップ（*", _
        "カ－ネルア－ミ－（B", _
        "カ－ネルア－ミ－（G", _
        "カ－ネルア－ミ－（R", _
        "カ－ネルア－ミ－（*", _
        "ブリザ－ドボ－ル（H", _
        "ブリザ－ドボ－ル（N", _
        "ブリザ－ドボ－ル（T", _
        "カウントボム２（C", _
        "カウントボム２（D", _
        "カウントボム２（E", _
        "カウントボム３（L", _
        "カウントボム３（M", _
        "カウントボム３（N", _
        "ビッグボム（O", _
        "ビッグボム（P", _
        "ビッグボム（V", _
        "ロ－ル（R", _
        "ロ－ル（*", _
        "ロ－ルＶ２（R", _
        "ロ－ルＶ３（R", _
        "ブル－ス（B", _
        "ブル－ス（*", _
        "ブル－スEX（B", _
        "ブル－スSP（B", _
        "ヒ－トマン（H", _
        "ヒ－トマン（*", _
        "ヒ－トマンEX（H", _
        "ヒ－トマンSP（H", _
        "エレキマン（E", _
        "エレキマン（*", _
        "エレキマンEX（E", _
        "エレキマンSP（E", _
        "スラッシュマン（S", _
        "スラッシュマン（*", _
        "スラッシュマンEX（S", _
        "スラッシュマンSP（S", _
        "キラ－マン（K", _
        "キラ－マン（*", _
        "キラ－マンEX（K", _
        "キラ－マンSP（K", _
        "チャ－ジマン（C", _
        "チャ－ジマン（*", _
        "チャ－ジマンEX（C", _
        "チャ－ジマンSP（C", _
        "アクアマン（A", _
        "アクアマン（*", _
        "アクアマンEX（A", _
        "アクアマンSP（A", _
        "トマホ－クマン（T", _
        "トマホ－クマン（*", _
        "トマホ－クマンEX（T", _
        "トマホ－クマンSP（T", _
        "テングマン（T", _
        "テングマン（*", _
        "テングマンEX（T", _
        "テングマンSP（T", _
        "グランドマン（G", _
        "グランドマン（*", _
        "グランドマンEX（G", _
        "グランドマンSP（G", _
        "ダストマン（D", _
        "ダストマン（*", _
        "ダストマンEX（D", _
        "ダストマンSP（D", _
        "ブラストマン（B", _
        "ブラストマン（*", _
        "ブラストマンEX（B", _
        "ブラストマンSP（B", _
        "ダイブマン（D", _
        "ダイブマン（*", _
        "ダイブマンEX（D", _
        "ダイブマンSP（D", _
        "サ－カスマン（C", _
        "サ－カスマン（*", _
        "サ－カスマンEX（C", _
        "サ－カスマンSP（C", _
        "ジャッジマン（J", _
        "ジャッジマン（*", _
        "ジャッジマンEX（J", _
        "ジャッジマンSP（J", _
        "エレメントマン（E", _
        "エレメントマン（*", _
        "エレメントマンEX（E", _
        "エレメントマンSP（E", _
        "カ－ネル（C", _
        "カ－ネル（*", _
        "カ－ネルEX（C", _
        "カ－ネルSP（C", _
        "ハクシャク（H", _
        "ハクシャク（*", _
        "ハクシャクEX（H", _
        "ハクシャクSP（H", _
        "ジャンゴ（D", _
        "ジャンゴ（*", _
        "ジャンゴＶ２（D", _
        "ジャンゴＶ３（D", _
        "パンチア－ム（A", _
        "パンチア－ム（B", _
        "パンチア－ム（C", _
        "パンチア－ム（*", _
        "ニ－ドルア－ム（A", _
        "ニ－ドルア－ム（B", _
        "ニ－ドルア－ム（C", _
        "ニ－ドルア－ム（*", _
        "パルスア－ム（A", _
        "パルスア－ム（B", _
        "パルスア－ム（C", _
        "パルスア－ム（*", _
        "ブ－メランア－ム（A", _
        "ブ－メランア－ム（B", _
        "ブ－メランア－ム（C", _
        "ブ－メランア－ム（*", _
        "シンクロトリガ－（A", _
        "シンクロトリガ－（B", _
        "シンクロトリガ－（C", _
        "シンクロトリガ－（*", _
        "ダ－クソ－ド（A", _
        "ダ－クソ－ド（B", _
        "ダ－クソ－ド（C", _
        "ダ－クソ－ド（*", _
        "ダ－クサンダ－（A", _
        "ダ－クサンダ－（B", _
        "ダ－クサンダ－（C", _
        "ダ－クサンダ－（*", _
        "ダ－クリカバリ－（A", _
        "ダ－クリカバリ－（B", _
        "ダ－クリカバリ－（C", _
        "ダ－クリカバリ－（*", _
        "ダ－クインビジ（A", _
        "ダ－クインビジ（B", _
        "ダ－クインビジ（C", _
        "ダ－クインビジ（*", _
        "ダ－クプラス（A", _
        "ダ－クプラス（B", _
        "ダ－クプラス（C", _
        "ダ－クプラス（*", _
        "フォルテ（F", _
        "ギガントフック（H", _
        "デルタレイエッジ（Z", _
        "カ－ネルフォ－ス（Q", _
        "バグライズソ－ド（V", _
        "フォルテアナザ－（F", _
        "メテオナックル（N", _
        "クロスディバイド（D", _
        "サイトバッチ（J", _
        "バグデスサンダ－（V", _
        "ダブルビ－スト（W", _
        "グレイガ（X", _
        "ファルザ－（X" _
    }

    'チップのアドレスリスト
    Public Shared chipAddrList() As Integer = { _
        &H223C, _
        &H223D, _
        &H223E, _
        &H223F, _
        &H2248, _
        &H2249, _
        &H224A, _
        &H224B, _
        &H2254, _
        &H2255, _
        &H2256, _
        &H2257, _
        &H2260, _
        &H226C, _
        &H226D, _
        &H226E, _
        &H226F, _
        &H2278, _
        &H2279, _
        &H227A, _
        &H2284, _
        &H2285, _
        &H2286, _
        &H2290, _
        &H229C, _
        &H229D, _
        &H229E, _
        &H229F, _
        &H22A8, _
        &H22A9, _
        &H22AA, _
        &H22AB, _
        &H22B4, _
        &H22B5, _
        &H22B6, _
        &H22B7, _
        &H22C0, _
        &H22C1, _
        &H22C2, _
        &H22CC, _
        &H22CD, _
        &H22CE, _
        &H22D8, _
        &H22D9, _
        &H22DA, _
        &H22E4, _
        &H22E5, _
        &H22E6, _
        &H22E7, _
        &H22F0, _
        &H22F1, _
        &H22F2, _
        &H22FC, _
        &H22FD, _
        &H22FE, _
        &H2308, _
        &H2314, _
        &H2315, _
        &H2316, _
        &H2317, _
        &H2320, _
        &H2321, _
        &H2322, _
        &H2323, _
        &H232C, _
        &H232D, _
        &H232E, _
        &H2338, _
        &H2339, _
        &H233A, _
        &H2344, _
        &H2345, _
        &H2346, _
        &H2350, _
        &H2351, _
        &H2352, _
        &H235C, _
        &H235D, _
        &H235E, _
        &H2368, _
        &H2369, _
        &H236A, _
        &H2374, _
        &H2375, _
        &H2376, _
        &H2380, _
        &H2381, _
        &H2382, _
        &H238C, _
        &H238D, _
        &H238E, _
        &H2398, _
        &H2399, _
        &H239A, _
        &H239B, _
        &H23A4, _
        &H23A5, _
        &H23A6, _
        &H23B0, _
        &H23B1, _
        &H23B2, _
        &H23BC, _
        &H23BD, _
        &H23BE, _
        &H23C8, _
        &H23C9, _
        &H23CA, _
        &H23D4, _
        &H23D5, _
        &H23D6, _
        &H23E0, _
        &H23E1, _
        &H23E2, _
        &H23EC, _
        &H23ED, _
        &H23EE, _
        &H23F8, _
        &H23F9, _
        &H23FA, _
        &H2404, _
        &H2405, _
        &H2406, _
        &H2410, _
        &H2411, _
        &H2412, _
        &H241C, _
        &H241D, _
        &H241E, _
        &H2428, _
        &H2429, _
        &H242A, _
        &H2434, _
        &H2435, _
        &H2436, _
        &H2437, _
        &H2440, _
        &H2441, _
        &H2442, _
        &H244C, _
        &H244D, _
        &H244E, _
        &H2458, _
        &H2459, _
        &H245A, _
        &H2464, _
        &H2465, _
        &H2466, _
        &H2470, _
        &H2471, _
        &H2472, _
        &H247C, _
        &H247D, _
        &H247E, _
        &H2488, _
        &H2489, _
        &H248A, _
        &H2494, _
        &H2495, _
        &H2496, _
        &H24A0, _
        &H24A1, _
        &H24A2, _
        &H24AC, _
        &H24AD, _
        &H24AE, _
        &H24B8, _
        &H24B9, _
        &H24BA, _
        &H24BB, _
        &H24C4, _
        &H24C5, _
        &H24C6, _
        &H24C7, _
        &H24D0, _
        &H24D1, _
        &H24D2, _
        &H24D3, _
        &H24DC, _
        &H24DD, _
        &H24DE, _
        &H24DF, _
        &H24E8, _
        &H24E9, _
        &H24EA, _
        &H24F4, _
        &H24F5, _
        &H24F6, _
        &H2500, _
        &H2501, _
        &H2502, _
        &H250C, _
        &H250D, _
        &H250E, _
        &H2518, _
        &H2519, _
        &H251A, _
        &H2524, _
        &H2525, _
        &H2526, _
        &H2530, _
        &H2531, _
        &H2532, _
        &H253C, _
        &H253D, _
        &H253E, _
        &H2548, _
        &H2549, _
        &H254A, _
        &H2554, _
        &H2555, _
        &H2556, _
        &H2560, _
        &H2561, _
        &H2562, _
        &H2563, _
        &H256C, _
        &H256D, _
        &H256E, _
        &H256F, _
        &H2578, _
        &H2579, _
        &H257A, _
        &H257B, _
        &H2584, _
        &H2585, _
        &H2586, _
        &H2587, _
        &H2590, _
        &H2591, _
        &H2592, _
        &H2593, _
        &H259C, _
        &H259D, _
        &H259E, _
        &H259F, _
        &H25A8, _
        &H25A9, _
        &H25AA, _
        &H25B4, _
        &H25B5, _
        &H25B6, _
        &H25C0, _
        &H25C1, _
        &H25C2, _
        &H25CC, _
        &H25CD, _
        &H25CE, _
        &H25D8, _
        &H25D9, _
        &H25DA, _
        &H25E4, _
        &H25E5, _
        &H25E6, _
        &H25F0, _
        &H25F1, _
        &H25F2, _
        &H25F3, _
        &H25FC, _
        &H25FD, _
        &H25FE, _
        &H2608, _
        &H2609, _
        &H260A, _
        &H2614, _
        &H2620, _
        &H2621, _
        &H2622, _
        &H262C, _
        &H2638, _
        &H2639, _
        &H263A, _
        &H2644, _
        &H2645, _
        &H2646, _
        &H2650, _
        &H2651, _
        &H2652, _
        &H265C, _
        &H265D, _
        &H265E, _
        &H265F, _
        &H2668, _
        &H2669, _
        &H266A, _
        &H266B, _
        &H2674, _
        &H2675, _
        &H2676, _
        &H2677, _
        &H2680, _
        &H2681, _
        &H2682, _
        &H268C, _
        &H268D, _
        &H268E, _
        &H2698, _
        &H2699, _
        &H269A, _
        &H26A4, _
        &H26A5, _
        &H26A6, _
        &H26B0, _
        &H26B1, _
        &H26B2, _
        &H26BC, _
        &H26BD, _
        &H26BE, _
        &H26C8, _
        &H26C9, _
        &H26CA, _
        &H26D4, _
        &H26D5, _
        &H26D6, _
        &H26E0, _
        &H26E1, _
        &H26E2, _
        &H26EC, _
        &H26ED, _
        &H26EE, _
        &H26F8, _
        &H26F9, _
        &H26FA, _
        &H2704, _
        &H2705, _
        &H2706, _
        &H2710, _
        &H2711, _
        &H2712, _
        &H271C, _
        &H271D, _
        &H271E, _
        &H2728, _
        &H2729, _
        &H272A, _
        &H2734, _
        &H2735, _
        &H2736, _
        &H2740, _
        &H2741, _
        &H2742, _
        &H274C, _
        &H274D, _
        &H274E, _
        &H2758, _
        &H2759, _
        &H275A, _
        &H2764, _
        &H2765, _
        &H2766, _
        &H2770, _
        &H2771, _
        &H2772, _
        &H277C, _
        &H277D, _
        &H277E, _
        &H2788, _
        &H2789, _
        &H278A, _
        &H2794, _
        &H2795, _
        &H2796, _
        &H27A0, _
        &H27A1, _
        &H27A2, _
        &H27AC, _
        &H27AD, _
        &H27AE, _
        &H27B8, _
        &H27B9, _
        &H27BA, _
        &H27C4, _
        &H27C5, _
        &H27C6, _
        &H27C7, _
        &H27D0, _
        &H27D1, _
        &H27D2, _
        &H27DC, _
        &H27DD, _
        &H27DE, _
        &H27E8, _
        &H27E9, _
        &H27EA, _
        &H27F4, _
        &H27F5, _
        &H27F6, _
        &H2800, _
        &H2801, _
        &H2802, _
        &H280C, _
        &H280D, _
        &H280E, _
        &H2818, _
        &H2819, _
        &H281A, _
        &H2824, _
        &H2825, _
        &H2826, _
        &H2830, _
        &H2831, _
        &H2832, _
        &H283C, _
        &H2848, _
        &H2854, _
        &H2855, _
        &H2856, _
        &H2857, _
        &H2860, _
        &H2861, _
        &H2862, _
        &H2863, _
        &H286C, _
        &H286D, _
        &H286E, _
        &H286F, _
        &H2878, _
        &H2879, _
        &H287A, _
        &H2884, _
        &H2885, _
        &H2886, _
        &H2890, _
        &H2891, _
        &H2892, _
        &H289C, _
        &H289D, _
        &H289E, _
        &H28A8, _
        &H28B4, _
        &H28C0, _
        &H28CC, _
        &H28CD, _
        &H28CE, _
        &H28D8, _
        &H28D9, _
        &H28DA, _
        &H28E4, _
        &H28F0, _
        &H28F1, _
        &H28F2, _
        &H28FC, _
        &H28FD, _
        &H28FE, _
        &H2908, _
        &H2909, _
        &H290A, _
        &H290B, _
        &H2914, _
        &H2915, _
        &H2916, _
        &H2917, _
        &H2920, _
        &H2921, _
        &H2922, _
        &H2923, _
        &H292C, _
        &H292D, _
        &H292E, _
        &H292F, _
        &H2938, _
        &H2939, _
        &H293A, _
        &H293B, _
        &H2944, _
        &H2950, _
        &H295C, _
        &H2968, _
        &H2969, _
        &H296A, _
        &H296B, _
        &H2974, _
        &H2975, _
        &H2976, _
        &H2977, _
        &H2980, _
        &H2981, _
        &H2982, _
        &H2983, _
        &H298C, _
        &H298D, _
        &H298E, _
        &H298F, _
        &H2998, _
        &H2999, _
        &H299A, _
        &H29A4, _
        &H29A5, _
        &H29A6, _
        &H29B0, _
        &H29B1, _
        &H29B2, _
        &H29BC, _
        &H29BD, _
        &H29BE, _
        &H29C8, _
        &H29D4, _
        &H29D5, _
        &H29D6, _
        &H29D7, _
        &H29E0, _
        &H29E1, _
        &H29E2, _
        &H29EC, _
        &H29ED, _
        &H29EE, _
        &H29F8, _
        &H2A04, _
        &H2A05, _
        &H2A06, _
        &H2A07, _
        &H2A10, _
        &H2A11, _
        &H2A12, _
        &H2A13, _
        &H2A1C, _
        &H2A28, _
        &H2A34, _
        &H2A40, _
        &H2A41, _
        &H2A42, _
        &H2A43, _
        &H2A4C, _
        &H2A4D, _
        &H2A4E, _
        &H2A4F, _
        &H2A58, _
        &H2A64, _
        &H2A70, _
        &H2A71, _
        &H2A72, _
        &H2A73, _
        &H2A7C, _
        &H2A88, _
        &H2A89, _
        &H2A8A, _
        &H2A8B, _
        &H2A94, _
        &H2A95, _
        &H2A96, _
        &H2AA0, _
        &H2AA1, _
        &H2AA2, _
        &H2AAC, _
        &H2AAD, _
        &H2AAE, _
        &H2AB8, _
        &H2AC4, _
        &H2AD0, _
        &H2ADC, _
        &H2ADD, _
        &H2ADE, _
        &H2AE8, _
        &H2AE9, _
        &H2AEA, _
        &H2AEB, _
        &H2AF4, _
        &H2AF5, _
        &H2AF6, _
        &H2AF7, _
        &H2B00, _
        &H2B01, _
        &H2B02, _
        &H2B03, _
        &H2B0C, _
        &H2B0D, _
        &H2B0E, _
        &H2B0F, _
        &H2B18, _
        &H2B24, _
        &H2B30, _
        &H2B3C, _
        &H2B48, _
        &H2B54, _
        &H2B60, _
        &H2B6C, _
        &H2B6D, _
        &H2B6E, _
        &H2B6F, _
        &H2B78, _
        &H2B79, _
        &H2B7A, _
        &H2B7B, _
        &H2B84, _
        &H2B85, _
        &H2B86, _
        &H2B90, _
        &H2B91, _
        &H2B92, _
        &H2B9C, _
        &H2B9D, _
        &H2B9E, _
        &H2BA8, _
        &H2BA9, _
        &H2BAA, _
        &H2C8C, _
        &H2C8D, _
        &H2C98, _
        &H2CA4, _
        &H2CB0, _
        &H2CB1, _
        &H2CBC, _
        &H2CC8, _
        &H2CD4, _
        &H2CD5, _
        &H2CE0, _
        &H2CEC, _
        &H2CF8, _
        &H2CF9, _
        &H2D04, _
        &H2D10, _
        &H2D1C, _
        &H2D1D, _
        &H2D28, _
        &H2D34, _
        &H2D40, _
        &H2D41, _
        &H2D4C, _
        &H2D58, _
        &H2D64, _
        &H2D65, _
        &H2D70, _
        &H2D7C, _
        &H2D88, _
        &H2D89, _
        &H2D94, _
        &H2DA0, _
        &H2DAC, _
        &H2DAD, _
        &H2DB8, _
        &H2DC4, _
        &H2DD0, _
        &H2DD1, _
        &H2DDC, _
        &H2DE8, _
        &H2DF4, _
        &H2DF5, _
        &H2E00, _
        &H2E0C, _
        &H2E18, _
        &H2E19, _
        &H2E24, _
        &H2E30, _
        &H2E3C, _
        &H2E3D, _
        &H2E48, _
        &H2E54, _
        &H2E60, _
        &H2E61, _
        &H2E6C, _
        &H2E78, _
        &H2E84, _
        &H2E85, _
        &H2E90, _
        &H2E9C, _
        &H2EA8, _
        &H2EA9, _
        &H2EB4, _
        &H2EC0, _
        &H2ECC, _
        &H2ECD, _
        &H2ED8, _
        &H2EE4, _
        &H2EF0, _
        &H2EF1, _
        &H2EFC, _
        &H2F08, _
        &H2F14, _
        &H2F15, _
        &H2F20, _
        &H2F2C, _
        &H2F38, _
        &H2F39, _
        &H2F44, _
        &H2F50, _
        &H2F5C, _
        &H2F5D, _
        &H2F5E, _
        &H2F5F, _
        &H2F68, _
        &H2F69, _
        &H2F6A, _
        &H2F6B, _
        &H2F74, _
        &H2F75, _
        &H2F76, _
        &H2F77, _
        &H2F80, _
        &H2F81, _
        &H2F82, _
        &H2F83, _
        &H2F8C, _
        &H2F8D, _
        &H2F8E, _
        &H2F8F, _
        &H2F98, _
        &H2F99, _
        &H2F9A, _
        &H2F9B, _
        &H2FA4, _
        &H2FA5, _
        &H2FA6, _
        &H2FA7, _
        &H2FB0, _
        &H2FB1, _
        &H2FB2, _
        &H2FB3, _
        &H2FBC, _
        &H2FBD, _
        &H2FBE, _
        &H2FBF, _
        &H2FC8, _
        &H2FC9, _
        &H2FCA, _
        &H2FCB, _
        &H304C, _
        &H3058, _
        &H3064, _
        &H3070, _
        &H307C, _
        &H3088, _
        &H3094, _
        &H30A0, _
        &H30AC, _
        &H30B8, _
        &H30C4, _
        &H30D0, _
        &H30DC, _
        &H30F4, _
        &H3100, _
        &H310C, _
        &H3118, _
        &H3124, _
        &H3130, _
        &H3131, _
        &H3132, _
        &H3133, _
        &H313C, _
        &H313D, _
        &H313E, _
        &H313F, _
        &H3148, _
        &H3149, _
        &H314A, _
        &H314B, _
        &H3154, _
        &H3155, _
        &H3156, _
        &H3157, _
        &H3160, _
        &H3161, _
        &H3162, _
        &H3163, _
        &H316C, _
        &H316D, _
        &H316E, _
        &H316F, _
        &H3178, _
        &H3179, _
        &H317A, _
        &H317B, _
        &H3184, _
        &H3185, _
        &H3186, _
        &H3187, _
        &H3190, _
        &H3191, _
        &H3192, _
        &H3193, _
        &H319C, _
        &H319D, _
        &H319E, _
        &H319F, _
        &H31A8, _
        &H31A9, _
        &H31AA, _
        &H31AB, _
        &H31B4, _
        &H31B5, _
        &H31B6, _
        &H31B7, _
        &H31C0, _
        &H31C1, _
        &H31C2, _
        &H31C3, _
        &H31CC, _
        &H31CD, _
        &H31CE, _
        &H31CF, _
        &H31D8, _
        &H31D9, _
        &H31DA, _
        &H31DB, _
        &H31E4, _
        &H31E5, _
        &H31E6, _
        &H31E7, _
        &H31FC, _
        &H31FD, _
        &H31FE, _
        &H31FF, _
        &H3208, _
        &H3209, _
        &H320A, _
        &H320B, _
        &H3214, _
        &H3215, _
        &H3216, _
        &H3217, _
        &H3220, _
        &H3221, _
        &H3222, _
        &H3223, _
        &H3244, _
        &H3245, _
        &H3246, _
        &H3247, _
        &H3250, _
        &H3251, _
        &H3252, _
        &H3253, _
        &H325C, _
        &H325D, _
        &H325E, _
        &H325F, _
        &H3268, _
        &H3269, _
        &H326A, _
        &H326B, _
        &H3274, _
        &H3275, _
        &H3276, _
        &H3277, _
        &H3280, _
        &H3281, _
        &H3282, _
        &H3283, _
        &H328C, _
        &H328D, _
        &H328E, _
        &H328F, _
        &H337C, _
        &H337D, _
        &H337E, _
        &H337F, _
        &H3388, _
        &H3389, _
        &H338A, _
        &H338B, _
        &H3394, _
        &H3395, _
        &H3396, _
        &H3397, _
        &H33A0, _
        &H33A1, _
        &H33A2, _
        &H33A3, _
        &H33AC, _
        &H33AD, _
        &H33AE, _
        &H33AF, _
        &H33B8, _
        &H33B9, _
        &H33BA, _
        &H33BB, _
        &H33C4, _
        &H33C5, _
        &H33C6, _
        &H33C7, _
        &H33D0, _
        &H33D1, _
        &H33D2, _
        &H33D3, _
        &H33DC, _
        &H33DD, _
        &H33DE, _
        &H33DF, _
        &H33E8, _
        &H33E9, _
        &H33EA, _
        &H33EB, _
        &H33F4, _
        &H33F5, _
        &H33F6, _
        &H33F7, _
        &H3400, _
        &H3401, _
        &H3402, _
        &H3403, _
        &H340C, _
        &H340D, _
        &H340E, _
        &H340F, _
        &H34F0, _
        &H34FC, _
        &H3508, _
        &H3514, _
        &H3520, _
        &H352C, _
        &H3538, _
        &H3544, _
        &H3550, _
        &H355C, _
        &H3568 _
    }


    'チップコードリスト
    Public Shared ChipCodeList() As Integer = { _
        &H1, &H201, &H401, &H3401, _
        &H1602, &H1802, &H1A02, &H3402, _
        &H2203, &H2403, &H2603, &H3403, _
        &H3404, _
        &H205, &H605, &H2405, &H3405, _
        &H606, &HA06, &H1606, _
        &H7, &HC07, &H2207, _
        &H2A08, _
        &H1609, &H1809, &H1A09, &H3409, _
        &HA, &H20A, &H40A, &H340A, _
        &H200B, &H220B, &H240B, &H340B, _
        &HC, &HC0C, &H220C, _
        &H160D, &H240D, &H2A0D, _
        &H20E, &H180E, &H1E0E, _
        &H40F, &H180F, &H260F, &H340F, _
        &H210, &H810, &H2210, _
        &H1A11, &H2011, &H2C11, _
        &HC12, _
        &H1613, &H1813, &H1A13, &H3413, _
        &HA14, &HC14, &HE14, &H3414, _
        &H2415, &H2615, &H2815, _
        &H416, &H616, &H816, _
        &H1E17, &H2017, &H2217, _
        &H18, &HA18, &H1418, _
        &HC19, &H1819, &H3219, _
        &H181A, &H241A, &H301A, _
        &H21B, &H81B, &H261B, _
        &H41C, &H161C, &H2A1C, _
        &HC1D, &H221D, &H241D, _
        &H21E, &H221E, &H241E, &H341E, _
        &H1F, &H81F, &H201F, _
        &H420, &H1620, &H1E20, _
        &H221, &H2221, &H2A21, _
        &H1222, &H1622, &H2422, _
        &H23, &H823, &H1223, _
        &H24, &H1224, &H2424, _
        &H225, &HC25, &H2425, _
        &H426, &H2226, &H2A26, _
        &H27, &H627, &H1827, _
        &H1028, &H1428, &H1E28, _
        &H829, &H2029, &H3229, _
        &HA2A, &H1A2A, &H2C2A, _
        &H2B, &H222B, &H262B, &H342B, _
        &H82C, &HC2C, &H242C, _
        &H22D, &HA2D, &H182D, _
        &HC2E, &H222E, &H262E, _
        &H2F, &H162F, &H2A2F, _
        &HE30, &H1E30, &H2430, _
        &HC31, &H2631, &H2A31, _
        &H1632, &H1832, &H1A32, _
        &HC33, &H1833, &H2C33, _
        &H1634, &H2234, &H2634, _
        &HC35, &H2435, &H2A35, _
        &H236, &H1636, &H2236, &H3436, _
        &H437, &H1437, &H2A37, &H3437, _
        &HC38, &H1838, &H1C38, &H3438, _
        &H1239, &H1639, &H2039, &H3439, _
        &HC3A, &H143A, &H223A, _
        &HE3B, &H1E3B, &H243B, _
        &H23C, &HA3C, &H1C3C, _
        &H43D, &H123D, &H1E3D, _
        &HA3E, &H143E, &H263E, _
        &H3F, &H163F, &H283F, _
        &H1240, &H1440, &H1640, _
        &H441, &H641, &H841, _
        &H1E42, &H2042, &H2242, _
        &HC43, &H2443, &H2A43, _
        &H44, &HA44, &H2444, &H3444, _
        &H45, &H1645, &H2245, &H3445, _
        &HE46, &H1A46, &H1E46, &H3446, _
        &HE47, &H1647, &H2447, &H3447, _
        &HE48, &H1648, &H2448, &H3448, _
        &HE49, &H1649, &H2449, &H3449, _
        &H24A, &H224A, &H2C4A, _
        &H24B, &H184B, &H2A4B, _
        &HA4C, &H1C4C, &H324C, _
        &H4D, &H104D, &H304D, _
        &H84E, &H144E, &H1A4E, _
        &HE4F, &H244F, &H2C4F, _
        &HA50, &H1250, &H2250, &H3450, _
        &H251, &H1651, &H1E51, _
        &H1452, &H2A52, &H2C52, _
        &H1A53, _
        &H54, &H1854, &H2654, _
        &H1855, _
        &HE56, &H1656, &H2056, _
        &H1257, &H1857, &H2857, _
        &H1A58, &H2258, &H3058, _
        &H59, &HC59, &H2659, &H3459, _
        &H45A, &H225A, &H285A, &H345A, _
        &H125B, &H165B, &H2A5B, &H345B, _
        &H85C, &HA5C, &HC5C, _
        &H165D, &H185D, &H1A5D, _
        &H225E, &H245E, &H265E, _
        &H25F, &H45F, &H65F, _
        &H660, &H860, &HA60, _
        &HA61, &HC61, &HE61, _
        &HA62, &H1462, &H1662, _
        &H863, &H1863, &H2A63, _
        &HC64, &H2464, &H3264, _
        &H65, &HC65, &H1665, _
        &H266, &H2266, &H3066, _
        &HE67, &H1267, &H2467, _
        &HC68, &H1468, &H2268, _
        &H1C69, &H2669, &H3069, _
        &H1A6A, &H286A, &H326A, _
        &H66B, &H86B, &HA6B, _
        &H226C, &H246C, &H266C, _
        &H6D, &H26D, &H46D, _
        &HE6E, &H1E6E, &H2A6E, _
        &H66F, &H186F, &H266F, _
        &H870, &H1C70, &H3270, _
        &H1271, &H1C71, &H2C71, _
        &H1A72, &H2872, &H3072, _
        &H1073, &H1473, &H2073, _
        &H1274, &H1474, &H2674, _
        &H275, &H1675, &H2A75, _
        &H1076, &H1876, &H2C76, _
        &H77, &H2277, &H2C77, &H3477, _
        &H1078, &H1478, &H3078, _
        &H679, &H1E79, &H2879, _
        &HE7A, &H187A, &H2A7A, _
        &H127B, &H147B, &H167B, _
        &H47C, &H67C, &H87C, _
        &H167D, &H187D, &H1A7D, _
        &HA7E, &HC7E, &H227E, _
        &H7F, &H167F, &H267F, _
        &H1A80, &H1C80, &H2680, _
        &H3481, _
        &H3482, _
        &H83, &H483, &H1E83, &H3483, _
        &H284, &HC84, &H3084, &H3484, _
        &H885, &HA85, &H1C85, &H3485, _
        &HE86, &H1886, &H1686, _
        &H887, &H1087, &H1E87, _
        &HE88, &H1C88, &H2A88, _
        &H2C89, &H3089, &H3289, _
        &H1A8A, _
        &H228B, _
        &H128C, _
        &HA8D, &H168D, &H2C8D, _
        &H1E8E, &H268E, &H2A8E, _
        &H348F, _
        &HA90, &HC90, &HE90, _
        &H91, &H2491, &H2691, _
        &H1E92, &H2492, &H3292, &H3492, _
        &H93, &HC93, &H2493, &H3493, _
        &H1094, &H1C94, &H2694, &H3494, _
        &H295, &H2295, &H2C95, &H3495, _
        &HA96, &H1A96, &H2496, &H3496, _
        &H1C97, _
        &H1E98, _
        &H1C99, _
        &H9A, &H69A, &H169A, &H349A, _
        &H89B, &H169B, &H209B, &H349B, _
        &H49C, &H189C, &H1E9C, &H349C, _
        &HE9D, &H149D, &H2A9D, &H349D, _
        &HA9E, &H1E9E, &H249E, _
        &H129F, &H189F, &H269F, _
        &H10A0, &H20A0, &H32A0, _
        &H12A1, &H1CA1, &H30A1, _
        &H34A2, _
        &H2A3, &HAA3, &H24A3, &H34A3, _
        &H2A4, &H18A4, &H24A4, _
        &H10A5, &H20A5, &H32A5, _
        &H34A6, _
        &HA7, &H16A7, &H22A7, &H34A7, _
        &HA8, &H2A8, &H24A8, &H34A8, _
        &H32A9, _
        &H34AA, _
        &H34AB, _
        &HAC, &H2AC, &HCAC, &H34AC, _
        &H8AD, &H18AD, &H22AD, &H34AD, _
        &H34AE, _
        &H34AF, _
        &H14B0, &H1EB0, &H32B0, &H34B0, _
        &H34B1, _
        &HB2, &HAB2, &H22B2, &H34B2, _
        &HEB3, &H1CB3, &H30B3, _
        &H14B4, &H28B4, &H2CB4, _
        &H10B5, &H20B5, &H32B5, _
        &H28B6, _
        &H34B7, _
        &H34B8, _
        &HCB9, &H16B9, &H22B9, _
        &HABA, &H16BA, &H26BA, &H34BA, _
        &HCBB, &H22BB, &H2ABB, &H34BB, _
        &HBC, &H22BC, &H32BC, &H34BC, _
        &HBD, &HABD, &H2ABD, &H34BD, _
        &H34BE, _
        &H34BF, _
        &H34C0, _
        &H34C1, _
        &H34C2, _
        &H34C3, _
        &H34C4, _
        &HCC5, &H24C5, &H28C5, &H34C5, _
        &H2C6, &HCC6, &H22C6, &H34C6, _
        &HEC7, &H1AC7, &H26C7, _
        &H4C8, &H6C8, &H8C8, _
        &H16C9, &H18C9, &H1AC9, _
        &H1CCA, &H1ECA, &H2ACA, _
        &H22DD, &H34DD, _
        &H22DE, _
        &H22DF, _
        &H2E0, &H34E0, _
        &H2E1, _
        &H2E2, _
        &HEE3, &H34E3, _
        &HEE4, _
        &HEE5, _
        &H8E6, &H34E6, _
        &H8E7, _
        &H8E8, _
        &H24E9, &H34E9, _
        &H24EA, _
        &H24EB, _
        &H14EC, &H34EC, _
        &H14ED, _
        &H14EE, _
        &H4EF, &H34EF, _
        &H4F0, _
        &H4F1, _
        &HF2, &H34F2, _
        &HF3, _
        &HF4, _
        &H26F5, &H34F5, _
        &H26F6, _
        &H26F7, _
        &H26F8, &H34F8, _
        &H26F9, _
        &H26FA, _
        &HCFB, &H34FB, _
        &HCFC, _
        &HCFD, _
        &H6FE, &H34FE, _
        &H6FF, _
        &H700, _
        &H301, &H3501, _
        &H302, _
        &H303, _
        &H704, &H3504, _
        &H705, _
        &H706, _
        &H507, &H3507, _
        &H508, _
        &H509, _
        &H130A, &H350A, _
        &H130B, _
        &H130C, _
        &H90D, &H350D, _
        &H90E, _
        &H90F, _
        &H510, &H3510, _
        &H511, _
        &H512, _
        &HF13, &H3513, _
        &HF14, _
        &HF15, _
        &H716, &H3516, _
        &H717, _
        &H718, _
        &H119, &H319, &H519, &H3519, _
        &H11A, &H31A, &H51A, &H351A, _
        &H11B, &H31B, &H51B, &H351B, _
        &H11C, &H31C, &H51C, &H351C, _
        &H11D, &H31D, &H51D, &H351D, _
        &H11E, &H31E, &H51E, &H351E, _
        &H11F, &H31F, &H51F, &H351F, _
        &H120, &H320, &H520, &H3520, _
        &H121, &H321, &H521, &H3521, _
        &H122, &H322, &H522, &H3522, _
        &HB2D, _
        &HF2E, _
        &H332F, _
        &H2130, _
        &H2B31, _
        &HB32, _
        &H1B33, _
        &H734, _
        &H1335, _
        &H2B36, _
        &H2D37, _
        &H2F38, _
        &H2F39 _
    }

    'マップコードリスト
    Public Shared MapListCode() As Integer = { _
        &H0, _
        &H100, _
        &H1, _
        &H101, _
        &H201, _
        &H301, _
        &H401, _
        &H2, _
        &H102, _
        &H202, _
        &H302, _
        &H402, _
        &H502, _
        &H602, _
        &H702, _
        &H802, _
        &H902, _
        &HA02, _
        &H3, _
        &H103, _
        &H203, _
        &H303, _
        &H403, _
        &H4, _
        &H104, _
        &H204, _
        &H304, _
        &H404, _
        &H5, _
        &H105, _
        &H205, _
        &H305, _
        &H6, _
        &H106, _
        &H206, _
        &H306, _
        &H406, _
        &H506, _
        &H80, _
        &H180, _
        &H81, _
        &H181, _
        &H281, _
        &H82, _
        &H182, _
        &H282, _
        &H83, _
        &H183, _
        &H283, _
        &H85, _
        &H185, _
        &H285, _
        &H385, _
        &H485, _
        &H88, _
        &H188, _
        &H388, _
        &H588, _
        &H688, _
        &H8C, _
        &H18C, _
        &H28C, _
        &H38C, _
        &H48C, _
        &H58C, _
        &H68C, _
        &H78C, _
        &H88C, _
        &H98C, _
        &HA8C, _
        &HB8C, _
        &HC8C, _
        &HD8C, _
        &HE8C, _
        &HF8C, _
        &H8D, _
        &H18D, _
        &H28D, _
        &H38D, _
        &H48D, _
        &H58D, _
        &H68D, _
        &H78D, _
        &H88D, _
        &H98D, _
        &HA8D, _
        &HB8D, _
        &HC8D, _
        &HD8D, _
        &HE8D, _
        &HF8D, _
        &H90, _
        &H190, _
        &H290, _
        &H91, _
        &H191, _
        &H291, _
        &H92, _
        &H192, _
        &H93, _
        &H193, _
        &H94, _
        &H194, _
        &H294, _
        &H95, _
        &H195, _
        &H295, _
        &H395, _
        &H96, _
        &H196, _
        &H296 _
    }

    'マップ名リスト
    Public Shared MapListName() As String = { _
        "秋原町", _
        "６×Ａ教室", _
        "セントラルタウン", _
        "熱斗のリビング", _
        "熱斗のへや", _
        "トイレ", _
        "アスタランド", _
        "６－１教室", _
        "６－２教室", _
        "１－１教室", _
        "１－２教室", _
        "１Ｆろうか", _
        "２Ｆろうか", _
        "げんかんホ－ル", _
        "職員室", _
        "校長室", _
        "だい１けんきゅう室", _
        "だい２けんきゅう室", _
        "シ－サイドタウン", _
        "すいぞくかん１", _
        "すいぞくかん２", _
        "ショーかいじょう", _
        "かんせいしつ", _
        "グリ－ンタウン", _
        "さいばんしょ　げんかん", _
        "さいばんしょ　ほうてい", _
        "おしおきべや", _
        "ちか室", _
        "かんりきょく", _
        "スカイタウン", _
        "オペレ－トル－ム", _
        "フォ－スル－ム", _
        "ばんぱくかいじょう", _
        "セントラルかん", _
        "シ－サイドかん", _
        "グリ－ンかん", _
        "スカイかん", _
        "", _
        "ロボせいぎょＰＣの電脳１", _
        "ロボせいぎょＰＣの電脳２", _
        "すいぞくかんの電脳１", _
        "すいぞくかんの電脳２", _
        "すいぞくかんの電脳３", _
        "しんぱんの木の電脳１", _
        "しんぱんの木の電脳２", _
        "しんぱんの木の電脳３", _
        "ウェザ－くんの電脳１", _
        "ウェザ－くんの電脳２", _
        "ウェザ－くんの電脳３", _
        "パビリオンの電脳１", _
        "パビリオンの電脳２", _
        "パビリオンの電脳３", _
        "パビリオンの電脳４", _
        "コピ－ロイドの電脳", _
        "熱斗のＨＰ", _
        "秋原町のＨＰ", _
        "すいぞくかんのＨＰ", _
        "グリーンのＨＰ", _
        "スカイのＨＰ", _
        "ロボット犬の電脳", _
        "パソコンの電脳１", _
        "６－１の電脳", _
        "６－２の電脳", _
        "１－１の電脳", _
        "１－２の電脳", _
        "トイレの電脳", _
        "エレベ－タ－の電脳", _
        "タイヤキやの電脳", _
        "かんしカメラの電脳", _
        "じてんの電脳", _
        "せんぷうきの電脳", _
        "ク－ラ－の電脳", _
        "ヒ－タ－の電脳", _
        "シャワ－の電脳", _
        "ヘリポ－トの電脳", _
        "パソコンの電脳２", _
        "じはんきの電脳", _
        "おしおきイスの電脳", _
        "水はんばいきの電脳", _
        "シンボルぞうの電脳", _
        "モニタ－の電脳", _
        "ポップコーン屋の電脳", _
        "職員室の電脳", _
        "すいどうかんの電脳", _
        "かんそくきの電脳", _
        "ボンベの電脳", _
        "校長室の電脳", _
        "マスコットの電脳", _
        "ヌイグルミヤの電脳", _
        "イヌ小屋の電脳", _
        "あんないパネルの電脳", _
        "セントラルエリア１", _
        "セントラルエリア２", _
        "セントラルエリア３", _
        "シ－サイドエリア１", _
        "シ－サイドエリア２", _
        "シ－サイドエリア３", _
        "グリ－ンエリア１", _
        "グリ－ンエリア２", _
        "アンダ－グラウンド１", _
        "アンダ－グラウンド２", _
        "スカイエリア１", _
        "スカイエリア２", _
        "秋原エリア", _
        "ウラインタ－ネット１", _
        "ウラインタ－ネットゼロ", _
        "ウラインタ－ネット２", _
        "ウラインタ－ネット３", _
        "グレイブヤ－ド１", _
        "グレイブヤ－ド２", _
        "イモータルエリア" _
    }

    'ライブラリ - スタンダードリップリスト
    Public Shared LibStandardChipNameList() As String = { _
        "キャノン", _
        "ハイキャノン", _
        "メガキャノン", _
        "エアシュート", _
        "バルカン１", _
        "バルカン２", _
        "バルカン３", _
        "スーパーバルカン", _
        "スプレッドガン１", _
        "スプレッドガン２", _
        "スプレッドガン３", _
        "センシャホウ１", _
        "センシャホウ２", _
        "センシャホウ３", _
        "ガンデルソル１", _
        "ガンデルソル２", _
        "ガンデルソル３", _
        "ヨーヨー", _
        "ヘルズバーナー１", _
        "ヘルズバーナー２", _
        "ヘルズバーナー３", _
        "ワイドショット", _
        "トレインアロー１", _
        "トレインアロー２", _
        "トレインアロー３", _
        "バブルスター１", _
        "バブルスター２", _
        "バブルスター３", _
        "サンダーボール", _
        "ドールサンダー１", _
        "ドールサンダー２", _
        "ドールサンダー３", _
        "エレキパルス１", _
        "エレキパルス２", _
        "エレキパルス３", _
        "コーンショット１", _
        "コーンショット２", _
        "コーンショット３", _
        "リスキーハニー１", _
        "リスキーハニー２", _
        "リスキーハニー３", _
        "ローリングログ１", _
        "ローリングログ２", _
        "ローリングログ３", _
        "アイアンシェル１", _
        "アイアンシェル２", _
        "アイアンシェル３", _
        "オーラヘッド１", _
        "オーラヘッド２", _
        "オーラヘッド３", _
        "エアホッケー", _
        "ドリルアーム", _
        "トルネード", _
        "ノイズストーム", _
        "マシンガン１", _
        "マシンガン２", _
        "マシンガン３", _
        "ミニボム", _
        "ビッグボム", _
        "エナジーボム", _
        "メガエナジーボム", _
        "フラッシュボム１", _
        "フラッシュボム２", _
        "フラッシュボム３", _
        "ブラックボム", _
        "バグボム", _
        "クサムラシード", _
        "アイスシード", _
        "ポイズンシード", _
        "ソード", _
        "ワイドソード", _
        "ロングソード", _
        "ワイドブレード", _
        "ロングブレード", _
        "フレイムソード", _
        "アクアソード", _
        "エレキソード", _
        "バンブーソード", _
        "フウジンラケット", _
        "フミコミザン", _
        "バリアブルソード", _
        "ネオバリアブル", _
        "エンゲツクナイ", _
        "ムラマサブレード", _
        "マシーンソード", _
        "エレメントソード", _
        "アサシンソード", _
        "クラックシュート", _
        "ダブルシュート", _
        "トリプルシュート", _
        "リフレクメット１", _
        "リフレクメット２", _
        "リフレクメット３", _
        "ウェーブアーム１", _
        "ウェーブアーム２", _
        "ウェーブアーム３", _
        "サンドワーム１", _
        "サンドワーム２", _
        "サンドワーム３", _
        "サモンブラック１", _
        "サモンブラック２", _
        "サモンブラック３", _
        "カモンスネーク", _
        "ナンバーボール", _
        "ファイアパンチ１", _
        "ファイアパンチ２", _
        "ファイアパンチ３", _
        "バーンスクエア１", _
        "バーンスクエア２", _
        "バーンスクエア３", _
        "リュウセイグン", _
        "アクアニードル１", _
        "アクアニードル２", _
        "アクアニードル３", _
        "ブリザードボール", _
        "キラーセンサー１", _
        "キラーセンサー２", _
        "キラーセンサー３", _
        "ブーメラン", _
        "ハイブーメラン", _
        "メガブーメラン", _
        "バンブーランス", _
        "ヒートドラゴン", _
        "エレキドラゴン", _
        "アクアドラゴン", _
        "ウッドドラゴン", _
        "ゴーレムパンチ１", _
        "ゴーレムパンチ２", _
        "ゴーレムパンチ３", _
        "ジャスティスワン", _
        "エアホイール１", _
        "エアホイール２", _
        "エアホイール３", _
        "トップウ", _
        "スイコミ", _
        "マグナム", _
        "サークルガン", _
        "ストーンキューブ", _
        "リトルボイラー１", _
        "リトルボイラー２", _
        "リトルボイラー３", _
        "エアレイド１", _
        "エアレイド２", _
        "エアレイド３", _
        "カウントボム１", _
        "カウントボム２", _
        "カウントボム３", _
        "ステルスマイン", _
        "オウエンカ", _
        "ディスコード", _
        "ティンパニー", _
        "サイレンス", _
        "ワラニンギョウ", _
        "オジゾウサン", _
        "ポイズンアヌビス", _
        "リカバリー１０", _
        "リカバリー３０", _
        "リカバリー５０", _
        "リカバリー８０", _
        "リカバリー１２０", _
        "リカバリー１５０", _
        "リカバリー２００", _
        "リカバリー３００", _
        "パネルスチール", _
        "エリアスチール", _
        "スチールパニシュ", _
        "スチールリベンジ", _
        "パネルリターン", _
        "デスマッチ", _
        "ホーリーパネル", _
        "サンクチュアリ", _
        "カミングロード", _
        "ゴーイングロード", _
        "ヘビーゲージ", _
        "クイックゲージ", _
        "フルカスタム", _
        "バスターアップ", _
        "バグシュウセイ", _
        "インビジブル", _
        "バリア", _
        "バリア１００", _
        "バリア２００", _
        "バブルラップ", _
        "ドリームオーラ", _
        "マグネコイル", _
        "カーネルアーミー", _
        "エレメントラップ", _
        "ナビスカウト", _
        "カワリミ", _
        "シラハドリ", _
        "バッドメディスン", _
        "ホワイトカプセル", _
        "アンインストール", _
        "コピーダメージ", _
        "ライフシンクロ", _
        "アタック＋１０", _
        "ナビ＋２０", _
        "カラーポイント", _
        "アタック＋３０", _
        "ダブルポイント" _
    }

    'ライブラリ - スタンダードチップフラグリスト
    'フラグアドレス、フラグ
    Public Shared LibStandardChipFlagList(,) As Integer = { _
        {&H204C, &H40}, _
        {&H204C, &H20}, _
        {&H204C, &H10}, _
        {&H204C, &H8}, _
        {&H204C, &H4}, _
        {&H204C, &H2}, _
        {&H204C, &H1}, _
        {&H204D, &H80}, _
        {&H204D, &H40}, _
        {&H204D, &H20}, _
        {&H204D, &H10}, _
        {&H204D, &H8}, _
        {&H204D, &H4}, _
        {&H204D, &H2}, _
        {&H204D, &H1}, _
        {&H204E, &H80}, _
        {&H204E, &H40}, _
        {&H204E, &H10}, _
        {&H204E, &H8}, _
        {&H204E, &H4}, _
        {&H204E, &H2}, _
        {&H204E, &H1}, _
        {&H204F, &H80}, _
        {&H204F, &H40}, _
        {&H204F, &H20}, _
        {&H204F, &H10}, _
        {&H204F, &H8}, _
        {&H204F, &H4}, _
        {&H204F, &H2}, _
        {&H204F, &H1}, _
        {&H2050, &H80}, _
        {&H2050, &H40}, _
        {&H2050, &H20}, _
        {&H2050, &H10}, _
        {&H2050, &H8}, _
        {&H2054, &H80}, _
        {&H2054, &H40}, _
        {&H2054, &H20}, _
        {&H2050, &H4}, _
        {&H2050, &H2}, _
        {&H2050, &H1}, _
        {&H2051, &H80}, _
        {&H2051, &H40}, _
        {&H2051, &H20}, _
        {&H205B, &H10}, _
        {&H205B, &H8}, _
        {&H205B, &H4}, _
        {&H2057, &H1}, _
        {&H2058, &H80}, _
        {&H2058, &H40}, _
        {&H2052, &H20}, _
        {&H2052, &H10}, _
        {&H2052, &H8}, _
        {&H2052, &H4}, _
        {&H2051, &H10}, _
        {&H2051, &H8}, _
        {&H2051, &H4}, _
        {&H2052, &H2}, _
        {&H2065, &H20}, _
        {&H2052, &H1}, _
        {&H2053, &H80}, _
        {&H2053, &H40}, _
        {&H2053, &H20}, _
        {&H2053, &H10}, _
        {&H2053, &H8}, _
        {&H2054, &H10}, _
        {&H2054, &H8}, _
        {&H2054, &H4}, _
        {&H2054, &H2}, _
        {&H2054, &H1}, _
        {&H2055, &H80}, _
        {&H2055, &H40}, _
        {&H2055, &H20}, _
        {&H2055, &H10}, _
        {&H2055, &H8}, _
        {&H2055, &H4}, _
        {&H2055, &H2}, _
        {&H2055, &H1}, _
        {&H2056, &H80}, _
        {&H2056, &H40}, _
        {&H2056, &H20}, _
        {&H2056, &H10}, _
        {&H2056, &H8}, _
        {&H2056, &H4}, _
        {&H2056, &H2}, _
        {&H2056, &H1}, _
        {&H2057, &H80}, _
        {&H2057, &H40}, _
        {&H2057, &H20}, _
        {&H2057, &H10}, _
        {&H205C, &H10}, _
        {&H205C, &H8}, _
        {&H205C, &H4}, _
        {&H2057, &H8}, _
        {&H2057, &H4}, _
        {&H2057, &H2}, _
        {&H2058, &H4}, _
        {&H2058, &H2}, _
        {&H2058, &H1}, _
        {&H205C, &H1}, _
        {&H205D, &H80}, _
        {&H205D, &H40}, _
        {&H205C, &H2}, _
        {&H205D, &H20}, _
        {&H2059, &H10}, _
        {&H2059, &H8}, _
        {&H2059, &H4}, _
        {&H2059, &H2}, _
        {&H2059, &H1}, _
        {&H205A, &H80}, _
        {&H205D, &H10}, _
        {&H2053, &H4}, _
        {&H2053, &H2}, _
        {&H2053, &H1}, _
        {&H2064, &H1}, _
        {&H205A, &H40}, _
        {&H205A, &H20}, _
        {&H205A, &H10}, _
        {&H205A, &H8}, _
        {&H205A, &H4}, _
        {&H205A, &H2}, _
        {&H205A, &H1}, _
        {&H2051, &H2}, _
        {&H2051, &H1}, _
        {&H2052, &H80}, _
        {&H2052, &H40}, _
        {&H205B, &H80}, _
        {&H205B, &H40}, _
        {&H205B, &H20}, _
        {&H205D, &H8}, _
        {&H205B, &H2}, _
        {&H205B, &H1}, _
        {&H205C, &H80}, _
        {&H205C, &H40}, _
        {&H205C, &H20}, _
        {&H205D, &H4}, _
        {&H205D, &H2}, _
        {&H205D, &H1}, _
        {&H2058, &H20}, _
        {&H2058, &H10}, _
        {&H2058, &H8}, _
        {&H2059, &H80}, _
        {&H2059, &H40}, _
        {&H2059, &H20}, _
        {&H205E, &H80}, _
        {&H2065, &H80}, _
        {&H2065, &H40}, _
        {&H205E, &H40}, _
        {&H205E, &H20}, _
        {&H205E, &H10}, _
        {&H205E, &H8}, _
        {&H205E, &H4}, _
        {&H205E, &H2}, _
        {&H205E, &H1}, _
        {&H205F, &H80}, _
        {&H205F, &H20}, _
        {&H205F, &H10}, _
        {&H205F, &H8}, _
        {&H205F, &H4}, _
        {&H205F, &H2}, _
        {&H205F, &H1}, _
        {&H2060, &H80}, _
        {&H2060, &H40}, _
        {&H2060, &H20}, _
        {&H2060, &H10}, _
        {&H2060, &H8}, _
        {&H2060, &H4}, _
        {&H2060, &H2}, _
        {&H2060, &H1}, _
        {&H2061, &H80}, _
        {&H2061, &H40}, _
        {&H2061, &H20}, _
        {&H2061, &H10}, _
        {&H2061, &H8}, _
        {&H2061, &H4}, _
        {&H2061, &H2}, _
        {&H2061, &H1}, _
        {&H2062, &H80}, _
        {&H2062, &H40}, _
        {&H2062, &H20}, _
        {&H2062, &H10}, _
        {&H2062, &H8}, _
        {&H2062, &H4}, _
        {&H2062, &H2}, _
        {&H2062, &H1}, _
        {&H2064, &H2}, _
        {&H2064, &H4}, _
        {&H2063, &H20}, _
        {&H2063, &H10}, _
        {&H2063, &H8}, _
        {&H2063, &H4}, _
        {&H2063, &H80}, _
        {&H2063, &H40}, _
        {&H2063, &H2}, _
        {&H2063, &H1}, _
        {&H2064, &H80}, _
        {&H2064, &H40}, _
        {&H2064, &H20}, _
        {&H2064, &H10}, _
        {&H2064, &H8} _
    }

    'ライブラリメガチップフラグリスト
    'フラグアドレス、フラグ
    Public Shared LibMegaChipFlagList(,) As Integer = { _
        {&H2067, &H4}, _
        {&H2067, &H2}, _
        {&H2067, &H1}, _
        {&H2068, &H80}, _
        {&H2068, &H40}, _
        {&H2068, &H20}, _
        {&H2068, &H10}, _
        {&H2068, &H8}, _
        {&H2068, &H4}, _
        {&H2068, &H2}, _
        {&H2068, &H1}, _
        {&H2069, &H80}, _
        {&H2069, &H40}, _
        {&H2069, &H20}, _
        {&H2069, &H10}, _
        {&H2069, &H8}, _
        {&H2069, &H4}, _
        {&H2069, &H2}, _
        {&H2069, &H1}, _
        {&H206A, &H80}, _
        {&H206A, &H40}, _
        {&H206C, &H40}, _
        {&H206C, &H20}, _
        {&H206C, &H10}, _
        {&H206C, &H8}, _
        {&H206C, &H4}, _
        {&H206C, &H2}, _
        {&H206C, &H1}, _
        {&H206D, &H80}, _
        {&H206D, &H40}, _
        {&H206D, &H20}, _
        {&H206D, &H10}, _
        {&H206D, &H8}, _
        {&H206D, &H4}, _
        {&H206D, &H2}, _
        {&H206D, &H1}, _
        {&H206E, &H80}, _
        {&H206E, &H40}, _
        {&H206E, &H20}, _
        {&H206E, &H10}, _
        {&H206E, &H8}, _
        {&H206E, &H4}, _
        {&H206E, &H2}, _
        {&H206E, &H1}, _
        {&H206F, &H80} _
    }

    'ライブラリメガチップ名リスト
    Public Shared LibMegaChipNameList() As String = { _
         "ロール", _
        "ロールＶ２", _
        "ロールＶ３", _
        "ブルース", _
        "ブルースEX", _
        "ブルースSP", _
        "ヒートマン", _
        "ヒートマンEX", _
        "ヒートマンSP", _
        "エレキマン", _
        "エレキマンEX", _
        "エレキマンSP", _
        "スラッシュマン", _
        "スラッシュマンEX", _
        "スラッシュマンSP", _
        "キラーマン", _
        "キラーマンEX", _
        "キラーマンSP", _
        "チャージマン", _
        "チャージマンEX", _
        "チャージマンSP", _
        "ブラストマン", _
        "ブラストマンEX", _
        "ブラストマンSP", _
        "ダイブマン", _
        "ダイブマンEX", _
        "ダイブマンSP", _
        "サーカスマン", _
        "サーカスマンEX", _
        "サーカスマンSP", _
        "ジャッジマン", _
        "ジャッジマンEX", _
        "ジャッジマンSP", _
        "エレメントマン", _
        "エレメントマンEX", _
        "エレメントマンSP", _
        "カーネル", _
        "カーネルEX", _
        "カーネルSP", _
        "ハクシャク", _
        "ハクシャクEX", _
        "ハクシャクSP", _
        "ジャンゴ", _
        "ジャンゴＶ２", _
        "ジャンゴＶ３" _
    }

    'ライブラリ - ギガチップ名リスト
    Public Shared LibGigaChipNameListAtGrayga() As String = { _
        "フォルテ", _
        "ギガントフック", _
        "デルタレイエッジ", _
        "カーネルフォース", _
        "バグライズソード" _
    }

    'ライブラリ - ギガチップフラグリスト
    'フラグアドレス,フラグ
    Public Shared LibGigaChipFlagListAtGrayga(,) As Integer = { _
        {&H2071, &H4}, _
        {&H2071, &H2}, _
        {&H2071, &H1}, _
        {&H2072, &H80}, _
        {&H2072, &H40} _
    }
    'ライブラリ - ギガチップ名リスト
    Public Shared LibGigaChipNameListAtFalther() As String = { _
        "フォルテアナザー", _
        "メテオナックル", _
        "クロスディバイド", _
        "サイトバッチ", _
        "バグデスサンダー" _
    }

    'ライブラリ - ギガチップフラグリスト
    'フラグアドレス,フラグ
    Public Shared LibGigaChipFlagListAtFalther(,) As Integer = { _
        {&H2072, &H20}, _
        {&H2072, &H10}, _
        {&H2072, &H8}, _
        {&H2072, &H4}, _
        {&H2072, &H2} _
    }
    'ライブラリ - シークレットチップ名リスト
    Public Shared LibSeacretChipNameList() As String = { _
        "オテンコサマ", _
        "ガンデルソルＥＸ", _
        "アクアマン", _
        "アクアマンEX", _
        "アクアマンSP", _
        "トマホークマン", _
        "トマホークマンEX", _
        "トマホークマンSP", _
        "テングマン", _
        "テングマンEX", _
        "テングマンSP", _
        "グランドマン", _
        "グランドマンEX", _
        "グランドマンSP", _
        "ダストマン", _
        "ダストマンEX", _
        "ダストマンSP" _
    }

    'ライブラリ - シークレットチップフラグリスト
    'フラグアドレス、フラグ
    Public Shared LibSeacretChipFlagList(,) As Integer = { _
        {&H205F, &H40}, _
        {&H204E, &H20}, _
        {&H206A, &H20}, _
        {&H206A, &H10}, _
        {&H206A, &H8}, _
        {&H206A, &H4}, _
        {&H206A, &H2}, _
        {&H206A, &H1}, _
        {&H206B, &H80}, _
        {&H206B, &H40}, _
        {&H206B, &H20}, _
        {&H206B, &H10}, _
        {&H206B, &H8}, _
        {&H206B, &H4}, _
        {&H206B, &H2}, _
        {&H206B, &H1}, _
        {&H206C, &H80} _
    }

    'ライブラリ - Ｐ．Ａ．名リスト
    Public Shared LibPaNameList() As String = { _
        "ギガキャノン１", _
        "ギガキャノン２", _
        "ギガキャノン３", _
        "ワイドバーナー１", _
        "ワイドバーナー２", _
        "ワイドバーナー３", _
        "フレイムフック１", _
        "フレイムフック２", _
        "フレイムフック３", _
        "パワーウェーブ１", _
        "パワーウェーブ２", _
        "パワーウェーブ３", _
        "コーンパーティー", _
        "パラレルシェル", _
        "デストロイパルス", _
        "ギガカウントボム", _
        "ストリームヘッド", _
        "スーパーワイド", _
        "ハイパーバースト", _
        "ドリームソード", _
        "ヨーヨーグレート", _
        "ジゴクホッケー", _
        "ポイズンファラオ", _
        "ボディガード", _
        "ダブルヒーロー", _
        "ダークメシア", _
        "マスタークロス", _
        "サンアンドムーン", _
        "ツインリーダーズ", _
        "クロスオーバー" _
    }

    'ライブラリ - Ｐ．Ａ．フラグリスト
    'フラグアドレス、フラグ
    Public Shared LibPaFlagList(,) As Integer = { _
        {&H2074, &H80}, _
        {&H2074, &H40}, _
        {&H2074, &H20}, _
        {&H2074, &H10}, _
        {&H2074, &H8}, _
        {&H2074, &H4}, _
        {&H2074, &H2}, _
        {&H2074, &H1}, _
        {&H2075, &H80}, _
        {&H2075, &H40}, _
        {&H2075, &H20}, _
        {&H2075, &H10}, _
        {&H2075, &H8}, _
        {&H2075, &H4}, _
        {&H2075, &H2}, _
        {&H2075, &H1}, _
        {&H2076, &H80}, _
        {&H2076, &H40}, _
        {&H2076, &H20}, _
        {&H2076, &H10}, _
        {&H2076, &H8}, _
        {&H2076, &H4}, _
        {&H2076, &H2}, _
        {&H2076, &H1}, _
        {&H2077, &H80}, _
        {&H2077, &H40}, _
        {&H2077, &H20}, _
        {&H2077, &H10}, _
        {&H2077, &H8}, _
        {&H2077, &H4} _
    }
End Class
